s1=[
	{'学号':1,'姓名':'赵奕','性别':'男','籍贯':'北京','年龄':20,'个人基本信息':{'身高':170,'体重':50,'爱好':['看电影','看书','游泳']},'家庭情况':['父亲','母亲']},
	{'学号':2,'姓名':'钱尔','性别':'男','籍贯':'北京','年龄':21,'个人基本信息':{'身高':173,'体重':55,'爱好':['打篮球','看书','下围棋']},'家庭情况':['父亲','母亲','姐姐']},
	{'学号':3,'姓名':'孙参','性别':'女','籍贯':'上海','年龄':23,'个人基本信息':{'身高':168,'体重':49,'爱好':['看电影','看书','下围棋']},'家庭情况':['父亲','母亲','哥哥']},
	{'学号':4,'姓名':'李斯','性别':'男','籍贯':'山东','年龄':19,'个人基本信息':{'身高':180,'体重':70,'爱好':['踢足球','打篮球','游泳']},'家庭情况':['父亲','母亲']},
	{'学号':5,'姓名':'周舞','性别':'女','籍贯':'北京','年龄':20,'个人基本信息':{'身高':159,'体重':45,'爱好':['看电影','看书']},'家庭情况':['父亲','母亲','妹妹']}
]
s2=[]
'''
for i in range(0,len(s1)):
	if (s1[i]['年龄']>19) and (s1[i]['性别']=='男') and (s1[i]['个人基本信息']['身高']>165) and ('看电影' in s1[i]['个人基本信息']['爱好']):
		s2.append(s1[i])
print(s2)
'''
def num(dict,n):
	if (dict[n]['学号']>0					and
		dict[n]['年龄']>0					and
		dict[n]['性别']=='男'				and
		dict[n]['籍贯']=='北京'				and
		dict[n]['个人基本信息']['身高']>165	and
		len(dict[n]['家庭情况'])==2):
		print(dict[n])
for i in range(0,len(s1)):
	num(s1,i)